| 测试类型    | 工具             | 场景说明                           |
| ------- | -------------- | ------------------------------ |
| 接口功能测试  | Postman / curl/jmeter| 测试 Range 返回、鉴权校验等逻辑是否正确        |
| 单接口性能测试 | ab             | 测试大文件全量下载的带宽和吞吐极限（但不适合测 Range） |
| 场景并发测试  | JMeter         | 模拟播放器并发拉流场景，逐块下载视频，测 Range 逻辑  |

## 接口功能测试
这里测试的是视频的Range字段请求是否有效；
分析如下，模拟了50个线程（模拟用户），每个线程发送20次请求，在10秒内发送所有请求（50*20=1000次请求）。
<img width="1613" height="847" alt="image" src="https://github.com/user-attachments/assets/0129606c-93c2-488a-9b09-47b6034472d2" />



## 单接口性能测试
📊 测试对比总览：
| 指标项           | 大视频 (86MB)                | 小视频 (7.9MB)             |
| ------------- | ------------------------- | ----------------------- |
| 请求总数 (`-n`)   | 1000                      | 1000                    |
| 并发数 (`-c`)    | 100                       | 100                     |
| 总耗时           | **556 秒**                 | **20 秒**                |
| 平均 RPS（请求数/秒） | **1.80 req/s**            | **49.60 req/s**         |
| 平均每个请求耗时（总视角） | **55654 ms / req**        | **2016 ms / req**       |
| 平均每个请求耗时（单请求） | **556.5 ms / req**        | **20.16 ms / req**      |
| 最大请求耗时        | **318,324 ms（超 5 分钟）**    | **3052 ms**             |
| 传输速率          | 151 MB/s                  | 375 MB/s                |
| 请求失败          | 0                         | 0                       |

对自研 HttpServer 框架的视频接口进行了性能压测，通过 Apache Benchmark 工具分别对小视频（8MB）与大视频（86MB）进行 100 并发、1000 请求的全流程下载测试，测试内容包括：\
高并发下的视频接口稳定性和资源利用；\
使用 Header 设计绕过鉴权逻辑，实现纯净性能测试；\
捕获视频文件读取、响应时间、吞吐量等关键指标；\
对大视频请求中暴露的 CPU 内存占用高、I/O 阻塞、请求长尾等瓶颈点进行逐步优化。\
\
✅ 测试结果：小文件接口处理速率约 49 req/s，总耗时 20s；大文件接口处理速率约 1.8 req/s，总耗时达 556s。

下面是通过Apache Bench (ab) 压测的具体截图
测试小视频文件的播放（7.9M）
  ```shell
  ab -n 1000 -c 100  -H "TestBypass:perf-token" http://192.168.218.128/videos/test.mp4
  ```
<img width="846" height="591" alt="image" src="https://github.com/user-attachments/assets/beade982-b420-4549-b838-036c8f30662a" />

测试大视频文件的播放(86M)
 ```shell
  ab -n 1000 -c 100  -H "TestBypass:perf-token" http://192.168.218.128/videos/safe%20and%20sound.mp4
  ```
<img width="672" height="697" alt="image" src="https://github.com/user-attachments/assets/4dc08af0-86f5-4877-9cf1-11ba956ccb24" />


## 场景并发测试
